
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 8 to change, 1 to destroy.</code></pre>

* Create
  * module.sa.time_rotating.rotate
* Update
  * azurerm_automation_account.automation_account
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_runbook.main
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_runbook.main
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.trigger_once
  * module.sa.azurerm_storage_account.storage_account
* Replace
  * module.sa.time_static.pim_expiry


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa"
        name                          = "hmi-stg-aa"
        tags                          = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (10 unchanged attributes hidden)

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/hmi-stg-mi",
                # (2 unchanged elements hidden)
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_runbook.main will be updated in-place
  ~ resource "azurerm_automation_runbook" "main" {
      ~ content                  = <<-EOT
            Param(
            
              [string]$environment,
            
              [string]$resource_group_name,
              [string]$storage_account_name,
              [string]$container_name,
              [string]$blob_name,
            
              [string]$key_vault_name,
              [string]$secret_name,
            
              [string]$permissions, #might need to change type
              [int]$expiry_days,
              [int]$remaining_days,
            
              [bool]$bypass_akv_network,
              [string]$umi_client_id = ""
            
            )
            
            # Functions
            function checkExpiry([datetime]$expiry) {
              # Get difference between expiry current date and expiry date
              $time_dif = (($expiry) - (Get-Date))
            
              # If token needs renewed...
              if ($time_dif.Days -le $remaining_days) {
                return $true
              }
              else {
                return $false
              }
            
            }
            
            Function generateSAS() {
            
              param (
                $saName,
                $containerName,
                $blobName,
                $permissions,
                $expiry_date,
                $start_date
              )
              try {
                
                #Write-Output "Generating Token in SA $storage_account_name"
                Enable-AzureRmAlias
            	  $context = $(Get-AzStorageAccount -ResourceGroupName $resource_group_name -Name $storage_account_name).Context
                $storage_context = New-AzureStorageContext -ConnectionString $($context.ConnectionString)
            
                if ($containerName -and $blobName) {
                  try {
                    # Generate SAS token (blob name)
                    $sas_token = New-AzureStorageBlobSASToken -Container $containerName -Blob $blobName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Blob token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                
                }
                elseif ($containerName) {
                  try {
                    # Generate SAS token (container name)
                    $sas_token = New-AzureStorageContainerSASToken -Name $containerName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Container token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
                else {
                  try {
                    # Generate SAS token (storage account)
                    $sas_token = New-AzureStorageAccountSASToken -Service Blob -ResourceType Service, Container, Object -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Storage Account token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
              }
              catch {
                Write-Error "Failed Generate Token. Aborting.";
                Write-Error "Error: $($_)";
                Disable-AzureRmAlias
                exit
              }
            
            }
            
            Function addSecretToKV() {
            
              param (
                $sasToken,
                $expiry_date,
                $start_date
              )
              try {
                $validity_period = [Timespan]($expiry_date - $start_Date)
                Write-Output "Validity period - $($validity_period)"
                Write-Output "Converting sas to secure string"
                $sas_secure = ConvertTo-SecureString $sasToken -AsPlainText -Force
            
                Write-Output "Adding sas to kv..."
                $secret = Set-AzKeyVaultSecret -VaultName $key_vault_name -Name $secret_name -SecretValue $sas_secure -Expires $expiry_date -NotBefore $start_date
                Write-Output "Secret - $($secret | ConvertTo-Json)"
                Write-OutPut "Secret added to kv!"
              }
              catch {
                Write-Error "Failed Set Secrect. Aborting.";
                Write-Error "Error: $($_)";
                exit
              }
              
            }
            
            ##########################################################
            
            try {
            
              #Log in with MI
              Write-Output "Connecting with MI..."
              if($umi_client_id -ne ""){
          -     Write-Host "Using User-managed identity"
          +     Write-Output "Using User-managed identity"
                Connect-AzAccount -Identity -accountId $umi_client_id
              } else {
                Connect-AzAccount -Identity
              }
            
              if($bypass_akv_network){
                $ip = Invoke-RestMethod -Uri api.ipify.org
          -     Write-host "Bypass required, add rule for $ip in $key_vault_name"
          +     Write-Output "Bypass required, add rule for $ip/32 in $key_vault_name"
          -     Add-AzKeyVaultNetworkRule -IpAddressRange $ip -VaultName $key_vault_name
          +     Add-AzKeyVaultNetworkRule -IpAddressRange "$ip/32" -VaultName $key_vault_name
              }
            
              # Get secret
              Write-Output "Getting secret..."
              $secret = Get-AzKeyVaultSecret -VaultName $key_vault_name -Name $secret_name
              Write-Output "secret - $($secret | ConvertTo-Json)"
              $start_date = Get-Date
              $expiry_date = $start_date.AddDays($expiry_days)
            
              # Check if secret exists
              if ($secret -and $secret.Expires) {
                # Check expiry of secret
                if (checkExpiry($secret.Expires)) {
                  # Create new token
                  Write-Output "Secret needs renewed. Creating new token"
                  $sas = generateSAS -saName $storage_account_name -containerName $container_name -blobName $blob_name -permissions $permissions -resourceGroupName $resource_group_name -start_date $start_date -expiry_date $expiry_date
                  # Add token to kv
                  addSecretToKV -sasToken $sas -expiry_date $expiry_date -start_date $start_date
            
                }
                else {
                  Write-Output "Secret does not need renewed."
                }
              }
              else {
                Write-Output "Secret does not exist. Creating secret."
                # Create token
                $sas = generateSAS -saName $storage_account_name -containerName $container_name -blobName $blob_name -permissions $permissions -resourceGroupName $resource_group_name -start_date $start_date -expiry_date $expiry_date
                # Add token to kv
                addSecretToKV -sasToken $sas -expiry_date $expiry_date -start_date $start_date
              }
            }
            catch {
              Write-Error "Failed to process. Aborting.";
              Write-Error "Error: $($_)";
              exit
            }
            
            if($bypass_akv_network){
          -   Write-host "Removing rule for $ip in $key_vault_name"
          +   Write-Output "Removing rule for $ip/32 in $key_vault_name"
          -   Remove-AzKeyVaultNetworkRule -IpAddressRange $ip -VaultName $key_vault_name
          +   Remove-AzKeyVaultNetworkRule -IpAddressRange "$ip/32" -VaultName $key_vault_name
            }
        EOT
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/runbooks/rotate-sas-tokens-hmisastg-rota-rl"
        name                     = "rotate-sas-tokens-hmisastg-rota-rl"
        tags                     = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (9 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule"
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule"
      ~ start_time              = "2024-11-16T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
      ~ start_time              = "2024-11-15T10:14:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_runbook.main will be updated in-place
  ~ resource "azurerm_automation_runbook" "main" {
      ~ content                  = <<-EOT
            Param(
            
              [string]$environment,
            
              [string]$resource_group_name,
              [string]$storage_account_name,
              [string]$container_name,
              [string]$blob_name,
            
              [string]$key_vault_name,
              [string]$secret_name,
            
              [string]$permissions, #might need to change type
              [int]$expiry_days,
              [int]$remaining_days,
            
              [bool]$bypass_akv_network,
              [string]$umi_client_id = ""
            
            )
            
            # Functions
            function checkExpiry([datetime]$expiry) {
              # Get difference between expiry current date and expiry date
              $time_dif = (($expiry) - (Get-Date))
            
              # If token needs renewed...
              if ($time_dif.Days -le $remaining_days) {
                return $true
              }
              else {
                return $false
              }
            
            }
            
            Function generateSAS() {
            
              param (
                $saName,
                $containerName,
                $blobName,
                $permissions,
                $expiry_date,
                $start_date
              )
              try {
                
                #Write-Output "Generating Token in SA $storage_account_name"
                Enable-AzureRmAlias
            	  $context = $(Get-AzStorageAccount -ResourceGroupName $resource_group_name -Name $storage_account_name).Context
                $storage_context = New-AzureStorageContext -ConnectionString $($context.ConnectionString)
            
                if ($containerName -and $blobName) {
                  try {
                    # Generate SAS token (blob name)
                    $sas_token = New-AzureStorageBlobSASToken -Container $containerName -Blob $blobName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Blob token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                
                }
                elseif ($containerName) {
                  try {
                    # Generate SAS token (container name)
                    $sas_token = New-AzureStorageContainerSASToken -Name $containerName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Container token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
                else {
                  try {
                    # Generate SAS token (storage account)
                    $sas_token = New-AzureStorageAccountSASToken -Service Blob -ResourceType Service, Container, Object -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Storage Account token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
              }
              catch {
                Write-Error "Failed Generate Token. Aborting.";
                Write-Error "Error: $($_)";
                Disable-AzureRmAlias
                exit
              }
            
            }
            
            Function addSecretToKV() {
            
              param (
                $sasToken,
                $expiry_date,
                $start_date
              )
              try {
                $validity_period = [Timespan]($expiry_date - $start_Date)
                Write-Output "Validity period - $($validity_period)"
                Write-Output "Converting sas to secure string"
                $sas_secure = ConvertTo-SecureString $sasToken -AsPlainText -Force
            
                Write-Output "Adding sas to kv..."
                $secret = Set-AzKeyVaultSecret -VaultName $key_vault_name -Name $secret_name -SecretValue $sas_secure -Expires $expiry_date -NotBefore $start_date
                Write-Output "Secret - $($secret | ConvertTo-Json)"
                Write-OutPut "Secret added to kv!"
              }
              catch {
                Write-Error "Failed Set Secrect. Aborting.";
                Write-Error "Error: $($_)";
                exit
              }
              
            }
            
            ##########################################################
            
            try {
            
              #Log in with MI
              Write-Output "Connecting with MI..."
              if($umi_client_id -ne ""){
          -     Write-Host "Using User-managed identity"
          +     Write-Output "Using User-managed identity"
                Connect-AzAccount -Identity -accountId $umi_client_id
              } else {
                Connect-AzAccount -Identity
              }
            
              if($bypass_akv_network){
                $ip = Invoke-RestMethod -Uri api.ipify.org
          -     Write-host "Bypass required, add rule for $ip in $key_vault_name"
          +     Write-Output "Bypass required, add rule for $ip/32 in $key_vault_name"
          -     Add-AzKeyVaultNetworkRule -IpAddressRange $ip -VaultName $key_vault_name
          +     Add-AzKeyVaultNetworkRule -IpAddressRange "$ip/32" -VaultName $key_vault_name
              }
            
              # Get secret
              Write-Output "Getting secret..."
              $secret = Get-AzKeyVaultSecret -VaultName $key_vault_name -Name $secret_name
              Write-Output "secret - $($secret | ConvertTo-Json)"
              $start_date = Get-Date
              $expiry_date = $start_date.AddDays($expiry_days)
            
              # Check if secret exists
              if ($secret -and $secret.Expires) {
                # Check expiry of secret
                if (checkExpiry($secret.Expires)) {
                  # Create new token
                  Write-Output "Secret needs renewed. Creating new token"
                  $sas = generateSAS -saName $storage_account_name -containerName $container_name -blobName $blob_name -permissions $permissions -resourceGroupName $resource_group_name -start_date $start_date -expiry_date $expiry_date
                  # Add token to kv
                  addSecretToKV -sasToken $sas -expiry_date $expiry_date -start_date $start_date
            
                }
                else {
                  Write-Output "Secret does not need renewed."
                }
              }
              else {
                Write-Output "Secret does not exist. Creating secret."
                # Create token
                $sas = generateSAS -saName $storage_account_name -containerName $container_name -blobName $blob_name -permissions $permissions -resourceGroupName $resource_group_name -start_date $start_date -expiry_date $expiry_date
                # Add token to kv
                addSecretToKV -sasToken $sas -expiry_date $expiry_date -start_date $start_date
              }
            }
            catch {
              Write-Error "Failed to process. Aborting.";
              Write-Error "Error: $($_)";
              exit
            }
            
            if($bypass_akv_network){
          -   Write-host "Removing rule for $ip in $key_vault_name"
          +   Write-Output "Removing rule for $ip/32 in $key_vault_name"
          -   Remove-AzKeyVaultNetworkRule -IpAddressRange $ip -VaultName $key_vault_name
          +   Remove-AzKeyVaultNetworkRule -IpAddressRange "$ip/32" -VaultName $key_vault_name
            }
        EOT
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/runbooks/rotate-sas-tokens-hmisastg-rota-rlw"
        name                     = "rotate-sas-tokens-hmisastg-rota-rlw"
        tags                     = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (9 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule"
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule"
      ~ start_time              = "2024-11-16T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
      ~ start_time              = "2024-11-15T10:14:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg"
        name                               = "hmisastg"
        tags                               = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.sa.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 23 -> (known after apply)
      ~ hour    = 12 -> (known after apply)
      ~ id      = "2024-11-23T12:52:18Z" -> (known after apply)
      ~ minute  = 52 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-23T12:52:18Z" -> (known after apply) # forces replacement
      ~ second  = 18 -> (known after apply)
      ~ unix    = 1732366338 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

Plan: 2 to add, 8 to change, 1 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sa.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-29T12:52:18Z"
      - rotation_rfc3339 = "2024-11-23T12:52:18Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":72,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->